Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Secretary Out-of-Order.tmx
Source language: en
Languages: es_419

source: ...but since you weren't answering, that jerk started sending letters to our side of the family.
es_419: … pero, como no contestabas, ese idiota empezó a enviar cartas a nuestra familia.

source: well, it doesn’t look like it.
es_419: Pues, no parece.

source: I want you to live your life, too.
es_419: Yo también quiero que vivas tu vida.

source: I think I was 23.
es_419: Creo que tenía 23 años.

source: I admit I've been rather negligent all this time.
es_419: Reconozco que he sido más bien negligente hasta ahora.

source: vroom
es_419: BRUUUM

source: korean food cooking class -hyehwa station
es_419: Clase de cocina coreana -estación Hyehwa

source: I was all over the place.
es_419: Era un desastre.

source: weekend mode (even though it's a weekday)
es_419: Modo fin de semana (aunque es día de semana)

source: GRAB
es_419: SUJETA

source: I want to know if she wants the same thing I do...
es_419: Quiero saber si ella quiere lo mismo que yo…

source: "careful observation is necessary to find the cause of the problem."
es_419: Debe observar con atención para hallar la causa del problema".

source: why?
es_419: ¿Por qué?

source: stop fantasizing. snap out of it!
es_419: Deja de fantasear. ¡Despierta ya!

source: tiresome
es_419: agobiante

source: dohyeok, why do you work late hours when you're the ceo?
es_419: Dohyeok, ¿por qué trabajas hasta tan tarde, si eres el CEO?

source: does daddy know about this?
es_419: ¿Papi ya sabe de esto?

source: she looks like a good and honest person.
es_419: Parece ser una persona buena y honesta.

source: hear what?
es_419: ¿Qué cosa?

source: dun
es_419: chan

source: ←persuaded.
es_419: ← LA CONVENCIÓ

source: birds of a feather flock together
es_419: Dios los cría y ellos se juntan

source: 2. putting salt in his coffee
es_419: 2. Ponerle sal en el café.

source: t h u d
es_419: P U M

source: I drank too much…
es_419: Bebí demasiado…

source: reach
es_419: EXTIENDE

source: I didn't think too much about it.
es_419: No le prestaba mucha atención.

source: hmm... by fixing, you mean flirting?
es_419: Mmm... ¿Arreglarla significa coquetear?

source: hyorin chae (age 25) dohyeok's cousin
es_419: Hyorin Chae (25 años) Prima de Dohyeok

source: I know a famous restaurant.
es_419: Conozco un restaurante famoso.

source: I guess it's because the company is paying for it.
es_419: Debe ser porque lo paga la empresa.

source: I think I need to get going, too.
es_419: Yo también me tengo que ir.

source: if I don't do it today, I'll lose my nerve again.
es_419: Si no lo hago hoy, me voy a acobardar de nuevo.

source: I've been so careless as your boss.
es_419: Fui un jefe muy descuidado.

source: 200x.12.27-
es_419: 27/12/200x -

source: not just because of that.
es_419: No solo por eso.

source: he turned into a totally different person…
es_419: Se convirtió en una persona totalmente distinta…

source: come to think of it, we never ate together before.
es_419: Ahora que lo pienso, nunca he comido con ella.

source: I didn't know...
es_419: No sabía…

source: I raised a tiger…
es_419: Desperté a la bestia…

source: my boy's all grown up,
es_419: Se creció mi niño,

source: cold
es_419: FRÍO

source: I was a prick, wasn't I?
es_419: Fui un imbécil, ¿no?

source: I'm going home.
es_419: Me voy a casa.

source: always ON TIME
es_419: SIEMPRE PUNTUAL

source: salt concentration level 100%
es_419: Sal concentrada al 100 %

source: I'll take it in baby steps. one step at a time.
es_419: Iré de a poquito. Pasito a paso.

source: take it out.
es_419: Quítalo.

source: w-what should I do?
es_419: ¿Qué hago?

source: howdy!
es_419: ¡Qué onda!

source: bank of korea
es_419: banco de Corea

source: She seems to be doing much better now.
es_419: Parece estar mucho mejor.

source: ...was an excellent and capable secretary.
es_419: … era una secretaria excelente y muy capacitada.

source: change of schedule?
es_419: ¿Cambiar los planes?

source: I know…
es_419: Ya sé…

source: ...ms. gam.
es_419: … señorita Gam.

source: what is wrong with him?
es_419: ¿Qué le pasa?

source: ...a life stuck in a rut like a hamster running on its wheel.
es_419: … una vida estancada, como un hámster que corre en la rueda.

source: SHY
es_419: TÍMIDO

source: You must be busy these days because of the new product.
es_419: Debes estar ocupada estos días, con lo del nuevo producto.

source: I'll be taking a break while everyone is busy building their careers.
es_419: Me tomaré un tiempo sabático mientras los demás están ocupados con su carrera.

source: I'm really sor--
es_419: Lo siento mu…

source: just once… I wanted to be carried away.
es_419: Por una vez… quise dejarme llevar.

source: ...but here I am, finally taking notice of his looks.
es_419: … pero aquí estoy: al fin le presto atención a su aspecto.

source: I actually made the film that I asked him to watch.
es_419: En realidad, le pedí que viera una película que yo hice.

source: lack of communication. must work on weekends. no work and life balance.
es_419: Falta de comunicación. Se trabaja los fines de semana. No tienes vida.

source: hello there, ms. gam!
es_419: ¡Hola, señorita Gam!

source: ...can't even brew a proper coffee.
es_419: … no puede ni hacer un buen café.

source: After getting fed up with Dohyeok’s ruthless workload and cruel behavior, she buys a lottery ticket out of impulse and wins.
es_419: Un día, harta de la inclemente carga laboral y las crueldades de Dohyeok, en un arrebato compra un billete de lotería, y gana.

source: is there anything you want?
es_419: ¿Quieres algo en especial?

source: How to properly discipline...
es_419: ¿Cómo disciplinar…

source: BLiNG
es_419: PLIN

source: what have I done to them?!
es_419: ¡¿Qué les he hecho?!

source: 3. adding cucumbers instead of pickles in his sandwich
es_419: 3. Agregar pepino en vez de pepinillos en el sándwich.

source: ugh. seriously.
es_419: Uff. De verdad.

source: Please.
es_419: Por favor.

source: it never once occurred to me all these years...
es_419: En todos estos años, jamás se me ocurrió…

source: yu-eun. why you...
es_419: Yu-eun. Si serás…

source: I'll call 911, so hang on--
es_419: Llamaré al 911, aguante, por fa…

source: I might be mistaken because I was drunk then.
es_419: Quizás esté equivocado, porque estaba ebrio.

source: crumple...
es_419: arruga…

source: …someone who thought that he could gain wealth and power easily.
es_419: … creía que podía hacerse rico y poderoso muy fácilmente.

source: I guess she is.
es_419: Se ve que sí.

source: of course.
es_419: Cómo no verlo.

source: oh, hold on, ms. gam--
es_419: Ah, espera, señorita Gam…

source: jeez...
es_419: Cielos…

source: whew
es_419: Fiu

source: I want to quit!
es_419: ¡Quiero renunciar!

source: crash
es_419: PUM

source: don't you know that outsiders aren't allowed in here?
es_419: ¿No sabías que solo pueden entrar huéspedes?

source: dang it!
es_419: ¡Rayos!

source: shut
es_419: BLAM

source: sure thing, miss.
es_419: Cómo no, señorita.

source: you haven't changed one bit.
es_419: No has cambiado nada.

source: I don't think I can eat more meat…
es_419: No puedo comer más carne…

source: ms. gam, i've been watching you lately…
es_419: Señorita Gam, la he estado observando…

source: fyi, "salt of iren" is the nickname that the press gave to him.
es_419: A propósito, la prensa le dio el apodo “la sal de IREN”.

source: oh… well…
es_419: Ah… Pues…

source: i think around one o'clock, sir.
es_419: Como a la una, creo, señor.

source: this coffee... is delicious.
es_419: El café… está delicioso.

source: he kept thanking me for working hard and saying that I did great work... and it was like the hurdles in my heart just fell over.
es_419: Me agradecía todo el tiempo por esforzarme y decía que lo estaba haciendo muy bien… y fue como si barreras de mi corazón se derribaran.

source: why am I suddenly venting at him?
es_419: ¿Por qué me descargo ahora con él?

source: I wish you good health, sir!
es_419: ¡Le deseo buena salud, señor!

source: do you need help putting it on?
es_419: ¿Te ayudo a ponértelo?

source: I guess it's okay.
es_419: Supongo que sí.

source: I'll be eating this all year...
es_419: Tardaré un año en comerlo…

source: off
es_419: APAGA

source: it's just that I imagined you naked!
es_419: ¡Es que te imaginé desnudo!

source: I saw a blog before I submitted my resume here.
es_419: Leí un blog antes de presentar mi currículum.

source: W-when?
es_419: ¿Cuándo?

source: you know you can take care of me anytime you want!
es_419: ¡Sabe que puede contar conmigo cuando quiera!

source: lift
es_419: LEVANTA

source: what I'm trying to say is...
es_419: Lo que intento decir es que…

source: I agreed to leave the company after four weeks...
es_419: Acepté quedarme en la empresa cuatro semanas más…

source: personal reasons
es_419: asuntos personales

source: I told you not to sit on my desk.
es_419: No te sientes más en mi escritorio.

source: now, why don't you...
es_419: Bien, ¿quiere…

source: furthermore, I've worked harder at my job than anyone.
es_419: Además, nadie se ha esforzado como yo en el trabajo.

source: if you're done, get lost.
es_419: Si terminaste, desaparece.

source: let me take you home.
es_419: Déjame llevarte a casa.

source: ...your last resort is to confess?!
es_419: … ¡¿tu último recurso es declararte?!

source: oh... sure. you do that.
es_419: Ah… bueno. Hazlo pues.

source: by the way,
es_419: Por cierto,

source: it's chilly now that it's dark.
es_419: Ahora que bajó el sol se puso frío.

source: so...
es_419: Y…

source: slap!
es_419: ¡PLAF!

source: c-come on in.
es_419: V-ven, pasa.

source: I'll think of what to do while I'm under the covers.
es_419: Pensaré qué hacer mientras estoy bajo las mantas.

source: play with me!
es_419: ¡Juega conmigo!

source: I-I think there was a misunderstanding--
es_419: C-creo que hay una confusión…

source: Yu-eun Gam, a very capable secretary, works at IREN under the relentless CEO, Dohyeok Chae.
es_419: Yu-eun Gam es una secretaria muy capacitada. Trabaja para Dohyeok Chae, el implacable CEO de IREN.

source: I won't tell dad!
es_419: ¡No le diré a papá!

source: yes, I know it's very sudden. we deeply apologize.
es_419: Sí, sé que es repentino. Le pido disculpas.

source: I saw hearts in your eyes.
es_419: Tenías corazones en los ojos.

source: let me also be honest with you, yu-eun.
es_419: Yo también seré sincero contigo, Yu-eun.

source: let me use this liquid courage to be honest.
es_419: Usaré esta valentía líquida para ser sincera.

source: oh. he's still conscious.
es_419: Ah. Está consciente.

source: address
es_419: Dirección

source: I think I took it too far though…
es_419: Pero creo que me pasé de la raya…

source: you think so?
es_419: ¿Tú crees?

source: I can end up behind bars.
es_419: Puedo terminar presa.

source: why aren't you picking up your phone?!
es_419: ¡¿Por qué no contestas el teléfono?!

source: there was no way we could be alike.
es_419: Es imposible que tuviéramos algo en común.

source: ...and focus on what I want to do from now on.
es_419: Mejor pienso en qué quiero hacer de ahora en adelante.

source: is she sick?
es_419: ¿Estará enferma?

source: stutter
es_419: TARTAMUDEA

source: why do you sleep so late?
es_419: ¿Por qué te acuestas tan tarde?

source: ms. kang.
es_419: Señorita Kang.

source: I'm here.
es_419: Llegué.

source: will iren…
es_419: ¿A IREN…

source: look
es_419: MIRA

source: spring!
es_419: ¡ZAS!

source: s-sir, where are we going?
es_419: ¿A-a dónde vamos, señor?

source: oh, don't say that. you're right next door.
es_419: No pasa nada, estamos al lado.

source: deja vu. jpg
es_419: déjà vu.jpg

source: something urgent came up, so I have to go.
es_419: Surgió algo urgente, así que me tengo que ir.

source: I think I know what that is. he's looking down on you.
es_419: Creo que ya sé qué pasa. Te está menospreciando.

source: now get lost.
es_419: Ahora, vete.

source: why don't you take the rest of the day off?
es_419: ¿Por qué no te tomas el resto del día?

source: I-I'm fine--
es_419: E-estoy bien…

source: I don't know...
es_419: No sé…

source: here are your entrees. yours is a filet mignon with...
es_419: Aquí está la entrada. Este es un filet mignon con…

source: I was your secretary for a year, and you still don't know my name!
es_419: Hace un año que soy tu secretaria, ¡y aún no te aprendes mi nombre!

source: come to think of it, you seem to read about diverse topics.
es_419: Ahora que lo pienso, parece que lee sobre diversos temas.

source: uh… so…
es_419: Eh… Pues…

source: what's this couple…
es_419: ¿Qué hacen estos dos?…

source: ※imagination
es_419: ※imaginación

source: yikes! it's cold!
es_419: ¡Aay! ¡Qué frío!

source: just ten more minutes…
es_419: Dame diez minutos más…

source: let‘s hurry up and leave.
es_419: Mejor vámonos ya.

source: or was it because I was tipsy?
es_419: ¿O fue porque había bebido?

source: whatever. just watch the film!!!
es_419: Ya fue. ¡¡Mira la peli y ya!!

source: I did it!
es_419: ¡Lo logré!

source: whew!
es_419: ¡Fiu!

source: sir, it's me.
es_419: Soy yo, señor.

source: gentle
es_419: amable

source: happiness pharmacy
es_419: FARMACIA ALEGRÍA

source: hey!
es_419: ¡Ey!

source: korea student aid foundation
es_419: Fundación coreana de apoyo escolar

source: I'll never find another smart and diligent employee like you, yu-eun.
es_419: Nunca encontraré otra empleada tan lista y diligente como tú, Yu-eun.

source: you know...
es_419: ¿Sabe qué?

source: that's why...
es_419: Por eso…

source: I know!
es_419: ¡Ya sé!

source: we'll keep the cast on for four weeks and monitor it...
es_419: Le dejaremos el yeso cuatro semanas, y lo controlaremos…

source: never mind.
es_419: No importa.

source: actually, no!
es_419: Digo, ¡no!

source: - episode 18 -
es_419: - episodio 18 -

source: looks like ms. gam is back.
es_419: Parece que la señorita Gam volvió.

source: - episode 03 -
es_419: - episodio 03 -

source: yes, master.
es_419: Sí, maestra.

source: mmph
es_419: MMF

source: she's never been late before.
es_419: Nunca había llegado tarde.

source: sounds good! let's get this done and over with.
es_419: Me parece bien! Terminémoslo de una vez.

source: pardon me for asking... but have you gone home for the night?
es_419: Disculpe la pregunta… Pero ¿ya terminó por hoy, se fue a casa?

source: All the while studying at college...
es_419: Todo mientras iba a la universidad…

source: okay!
es_419: Bueno!

source: ahhh!!!
es_419: ¡¡¡Aaah!!!

source: it's the first time I'm meeting someone for the sake of meeting them.
es_419: Es la primera vez que conozco a alguien solo por conocerlo.

source: that there is a secretary who made him change.
es_419: que lo hizo cambiar una secretaria.

source: I'm sorry I'm late.
es_419: Lamento llegar tarde.

source: I love it!!!
es_419: ¡¡Me encanta!!

source: you must have been exhausted. did you sleep well?
es_419: Seguro estabas exhausta. ¿Dormiste bien?

source: ...but I hear they used to call him...
es_419: … pero he oído que le decían…

source: let go!
es_419: ¡Suéltame!

source: and my parents died in a car accident.
es_419: Y mis padres murieron en un accidente.

source: Full of hope for her future, she hands in a letter of resignation only to be rejected.
es_419: Colmada de anhelos para su futuro, presenta su renuncia. Pero Dohyeok se la rechaza.

source: even if it's dohyeok.
es_419: Aunque sea Dohyeok.

source: it's okay. it was nice going for a drive.
es_419: Está bien. El paseo en auto fue agradable.

source: don't worry, jiwoo.
es_419: Descuida, Jiwoo.

source: no matter how you live, everyone dies the same.
es_419: No importa cómo vivas, todo el mundo muere igual.

source: blah blah blah
es_419: bla bla bla

source: investment trend / 20s checkpoint
es_419: tendencias en inversión / logros veinteañeros

source: just because we were watching a movie together?
es_419: ¿Solo porque íbamos a ver una película juntos?

source: telling dohyeok it's the end...
es_419: Le dije a Dohyeok que se terminó…

source: is this okay?
es_419: ¿Estará bien?

source: since you took all my work…
es_419: Porque me quitó todo el trabajo…

source: we're too old to be reckless.
es_419: Estamos grandes para ser imprudentes.

source: but she is "a girl you like."
es_419: Pero es la chica que te gusta.

source: I'm rejecting your resignation.
es_419: Rechazo tu renuncia.

source: is he trying to use his good looks to his advantage?
es_419: ¿Está tratando de sacar provecho de su aspecto?

source: one hour later...
es_419: Una hora después…

source: what have you done?!
es_419: ¡¿Qué has hecho?!

source: shudder
es_419: SE ESTREMECE

source: be frank with me.
es_419: Dime la verdad.

source: Kang, change the schedule for tomorrow’s meeting.
es_419: Kang, cambia el horario de la reunión de mañana.

source: AH~!
es_419: ¡AGH!

source: yikes.
es_419: Aia.

source: yes, sir...
es_419: Sí, señor…

source: I'm not going to give up on you.
es_419: No te dejaré ir así, sin más.

source: there's no turning back!
es_419: ¡No hay vuelta atrás!

source: a useful trick from the experienced.
es_419: Truco útil de alguien con experiencia.

source: Of course, I don't know the whole story since I'm new here...
es_419: Claro, no sé muy bien qué pasó porque soy nueva…

source: *about 1.6 million USD
es_419: * MÁS O MENOS 1,6 MILLONES DE USD.

source: I didn't want to have a simple and quick meal.
es_419: No quería comer algo sencillo y rápido.

source: I'll be honest with you.
es_419: Seré sincera.

source: nibble
es_419: BOCADITOS

source: my name is yu-eun gam.
es_419: Me llamo Yu-eun Gam.

source: is this what rags to riches feels like?
es_419: ¿Así es pasar de mendiga a millonaria?

source: ...I have to wash the dishes.
es_419: … tendré que lavar todo.

source: jiwoo, he's…
es_419: Jiwoo, él es…

source: oh, I forgot she resigned.
es_419: Ah, lo olvidé. Renunció.

source: they went too soon. they were such good people.
es_419: Se fueron muy pronto. Eran tan buenas personas.

source: just come.
es_419: Ven y ya.

source: Well...
es_419: Pues…

source: Open up!
es_419: ¡Abre!

source: a lot of cucumbers, please!
es_419: ¡Mucho pepino, por favor!

source: when's my next appointment with the finance manager?
es_419: ¿Cuándo es la próxima cita con la asesora financiera?

source: then... are you going on a working holiday?
es_419: Entonces… ¿te tomarás un tiempo sabático?

source: yell
es_419: GRITA

source: sorry.
es_419: Lo siento.

source: Rumor has it...
es_419: Se rumorea…

source: ahhh!
es_419: ¡Aaah!

source: you said your office was nearby? do you mind if I ask where you work?
es_419: ¿Dijiste que trabajas por aquí cerca? ¿Puedo preguntarte cuál es la empresa?

source: he works at some major corporation.
es_419: Trabaja en una empresa importante.

source: You know how the workshop was rescheduled?
es_419: ¿Viste que reprogramaron el taller?

source: except for the fact that he's from a wealthy family.
es_419: salvo que proviene de una familia adinerada.

source: what? n-no way!
es_419: ¿Qué? ¡P-para nada!

source: you don't have to worry about me.
es_419: Así que no te preocupes por mí.

source: "connecting with the child out-of-order."
es_419: "comunicarse con el niño descarriado".

source: I didn't mean for us to drink this much.
es_419: No era mi intención que bebiéramos tanto.

source: I must be out of my mind!
es_419: ¡Me estoy volviendo loca!

source: mr. chae!!!
es_419: ¡¡Señor Chae!!

source: w-why is he coming over to me?
es_419: ¿P-por qué se me acerca?

source: ...don't have any financial goals.
es_419: … no tengo ninguna meta financiera.

source: ...something similar to that.
es_419: … algo así.

source: h-how about some coffee after lunch?
es_419: ¿B-bebemos un café después de almorzar?

source: annual schedule
es_419: agenda anual

source: no, that's not necessary.
es_419: No, no hace falta.

source: ...you're jealous, are you?
es_419: Estás celoso, ¿no?

source: I wish you could come inside.
es_419: Me gustaría que vinieras a casa.

source: Hello.
es_419: Hola.

source: if he has a child...
es_419: Si sí es padre…

source: ack...
es_419: Ay…

source: made an excuse to come here and have fun
es_419: Inventó una excusa para venir a divertirse

source: what? object?
es_419: ¿Qué? ¿Se opone?

source: 3. adding cucumber instead of pickles in his sandwich
es_419: 3. Agregar pepino en vez de pepinillos en el sándwich.

source: lovesick.
es_419: De amor.

source: submit for approval
es_419: PARA APROBAR

source: so, let's be responsible and finish on a high note!
es_419: Bien, ¡seré responsable y terminaré del mejor modo!

source: I-I'll take note of that, sir.
es_419: L-lo tendré en cuenta, señor.

source: Dinner is ready, sir.
es_419: Ya está la cena, señor.

source: Really?
es_419: ¿En serio?

source: ms. gam, can you come to my office?
es_419: Señorita Gam, puede venir a mi oficina?

source: we're at a stage in our lives when we need to build our careers.
es_419: Estamos en una etapa de la vida en que debemos forjarnos una carrera.

source: hey, I thought you were sleeping.
es_419: Ey, pensé que estabas durmiendo.

source: what matters is what you do until then.
es_419: Lo que importa es qué haces hasta entonces.

source: I guess I really did have a hard time.
es_419: Supongo que sí la he pasado muy mal.

source: plus, he's young and rich.
es_419: Además, es joven y rico.

source: I think Around one o’clock, sir.
es_419: Como a la una, creo, señor.

source: oh, I'm good with anything.
es_419: Ah, cualquier cosa me viene bien.

source: well,
es_419: Eh,

source: let's see.
es_419: A ver.

source: oh, dohyeok!
es_419: ¡Ay, Dohyeok!

source: you're the best secretary! and the best predecessor!
es_419: ¡Eres la mejor secretaria! ¡Y la mejor predecesora!

source: ...the time she gets off work is rather irregular...
es_419: … pero el horario de salida es bastante irregular…

source: whew, I finally made it.
es_419: Fiu, al fin llego.

source: there's no use denying it. things will get worse if I don't tell the truth.
es_419: De qué vale negarlo. Si no digo la verdad, va a ser todo cada vez peor.

source: yes, ma’am.
es_419: Sí, señora.

source: why can't they keep their private and public life separate…
es_419: ¿Por qué no pueden separar la vida privada de la pública?

source: there's something he always said.
es_419: Mi tío siempre decía lo mismo.

source: what he said…
es_419: Lo que dijo…

source: I put salt in your coffee and asked for extra cucumbers in your sandwich just to spite you.
es_419: Le puse sal en el café y pedí que pusieran pepinos de más en su sándwich para fastidiarlo.

source: that-a-girl.
es_419: Así me gusta.

source: I don't know what you're talking about!
es_419: ¡No tengo idea de lo que dice!

source: I really am!
es_419: ¡De verdad!

source: happiness!
es_419: ¡muy felices!

source: but I had no way to find out.
es_419: Pero fue imposible confirmarlo.

source: w-why would he do that?
es_419: ¿P-por qué haría eso?

source: I, yu-eun gam...
es_419: Yo, Yu-eun Gam…

source: they called him iren's salt...
es_419: Lo llamaron la sazón de IREN…

source: - episode 17 -
es_419: - episodio 17 -

source: I have no prejudice about things like that.
es_419: No tengo prejuicios sobre ese tipo de cosas.

source: Thank god I cleaned the place.
es_419: Menos mal que limpié un poco.

source: all these dark, luxurious pieces of furniture?
es_419: todos estos muebles oscuros y lujosos?

source: pant
es_419: jadea

source: to warn you, I know all your dirty little tricks. something like that.
es_419: Para advertirte: conozco todos tus truquitos. Algo así.

source: it's summer already.
es_419: Llegó el verano.

source: He'll just some old man once you leave work.
es_419: Cuando te vayas de allí será un viejo más.
